# FilePath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions..::..FilePath Property
ImageExportOptions Class See Also
---
The file name and path for the exported file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string FilePath { get; set; }
```

Visual Basic
---
```text
Public Property FilePath As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ FilePath {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
If ExportRange is SetOfViews, the name of each view or sheet will be appended to the name provided for each exported file. This field is ignored if used to save an image to a project as a new view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input file path is not valid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace